[
    {
        "url": "https://economictimes.indiatimes.com/topic/government-and-sports-ministry/news/india/arunachal-pradesh-integral-part-of-india-anurag-thakur-on-cancelling-china-visit-for-asian-games/articleshow/103889436.cms",
        "inLanguage": "en",
        "headline": " Arunachal Pradesh, integral part of India : Anurag Thakur on cancelling China visit for Asian Games",
        "description": "Indian Sports Minister, Anurag Thakur, has cancelled his visit to the Asian Games in China after three Wushu players from Arunachal Pradesh were denied visas. Thakur stated that he decided to cancel his visit as a mark of protest against China's refusal. The Ministry of External Affairs spokesperson said that India reserves the right to take measures to safeguard its interests and rejects the differential treatment of its players based on domicile or ethnicity. ",
        "datePublished": "2023-09-23T16:30:00+05:30",
        "articleBody": "Union Sports Minister Anurag Thakur on Saturday stated that after China refused visas of three Wushu players from Arunachal Pradesh, he decided to cancel his visit to the Asian Games. Three Indian Wushu players Nyeman Wangsu, Onilu Tega and Mepung Lamgu were denied entry to China to compete in the Hangzhou Asian Games on Friday.Anurag Thakur asserted that Arunachal Pradesh is an integral part of India. When they (China) refused a visa to three of our athletes (for Asian Games) who hail from the state of Arunachal Pradesh. I decided that I will not go and participate in the Asian Games because Arunachal Pradesh is an integral part of India,  Anurag Thakur said at an event in Coimbatore. Earlier, Anurag Thakur had cancelled his visit to China for the Asian Games on Friday as a reply to China's denial of visas to Wushu players. Ministry of External Affairs Spokesperson, Arindam Bagchi said that India reserved the right to take measures to safeguard its interests. As a mark of our protest against the Chinese action, the Minister of Information and Broadcasting and Youth Affairs and Sports of India has cancelled his scheduled visit to China for the Games. Government of India reserves the right to take suitable measures to safeguard our interest,  Bagchi said.The MEA spokesperson said that India rejects the treatment of its players by Chinese Authorities. Government of India has learnt that the Chinese authorities have, in a targeted and pre-meditated manner, discriminated against some of the Indian sportspersons from the state of Arunachal Pradesh by denying them accreditation and entry to the 19th Asian Games in Hangzhou, China  he said. In line with our long-standing and consistent position, India firmly rejects differential treatment of Indian citizens on the basis of domicile or ethnicity. Arunachal Pradesh was, is and will always remain an integral and inalienable part of India,  Arindam Bagchi added.The athletes were to take part in individual events of the martial arts sport."
    },
    {
        "url": "https://economictimes.indiatimes.com/topic/government-and-sports-ministry/news/india/document-experiences-of-organising-g20-pm-modi-to-officials/articleshow/103870409.cms",
        "inLanguage": "en",
        "headline": "G20 Summit success has given nation confidence to organise global events: PM Modi",
        "description": "Addressing the officials, Modi lauded their contribution and the spirit with which they tackled challenges during the summit.   The credit for the success of the G20 Summit goes to all of you. I have a request to document your experiences. This will serve as guidelines for future events,  Modi said.  The prime minister suggested setting up a website to document the experiences of the organisers.",
        "datePublished": "2023-09-22T19:41:00+05:30",
        "articleBody": "Prime Minister Narendra Modi on Friday said the G20 Summit's success has given the nation the confidence to organise such global events and urged those involved in the planning and execution of the summit to document their experiences.The G20 Summit, under India's presidency, was held here from September 9 to 10.Addressing those involved in organising of the summit at the event's venue, Bharat Mandapam, Modi also credited ground-level functionaries for the success.Drawing parallels between the organising of the G20 Summit and the Commonwealth Games, he said the sporting event in the national capital in 2010 got mired into things that brought disrepute to the country and infused a sense of despondency in the governing system. On the other hand, the cumulative effect of the G20 Summit has been that of success in showcasing the strength of the country to the world. I am not concerned with the praise in editorials. For me, the real happiness lies in the fact that my country is now confident that it can host any such event in the best possible way,  the prime minister said.He said in this event, Union Ministers and the senior officers were occupying the rear seats while ground-level functionaries were at the forefront.  I like this arrangement as it assures me that my foundation is strong,  Modi said.During the programme, the prime minister asked the functionaries to sit informally and share their experiences in their respective departments. In routine office work one does not come to know the capabilities of their colleagues, he said.This, Modi said, puts one's performance in a broader perspective.  Once we know the efforts of others, that pushes us to do better. Today's programme is about mazdoor ekta zindabad. We all are mazdoor (labourers). Main thoda bada mazdoor hoon, aap thode chhote mazdoor. Hum sab toh mazdoor hain. (I am a bigger mazdoor, you are smaller mazdoors. We all are labourers,  he said.Referring to the elaborate planning and execution process, the prime minister asked the functionaries to document their experiences and learnings. The document, thus prepared, can be useful to form guidelines for future events, he said.The secret of success of such big events are the sense of importance of enterprise and a feeling of being a central part of that enterprise in everyone, Modi said.He also cited India's contribution in rescue and relief efforts during calamities such as the earthquakes in Nepal and Turkiye, cyclone in Fiji and the crises in Sri Lanka and the Maldives.  All this showed India standing strong and reaching everywhere in times of need,  Modi said.The prime minister underlined the need for global exposure in order to improve further and said global approach and context should underline all work.The interaction saw the participation of around 3,000 people, who have contributed to the success of G20 Summit.It especially included those who have worked at the ground level such as cleaners, drivers, waiters and other staffers from various ministries. The interaction was also attended by ministers and officials of various departments. "
    },
    {
        "url": "https://economictimes.indiatimes.com/topic/government-and-sports-ministry/news/politics-and-nation/punjab-bjp-chief-welcomes-centres-decision-to-suspend-visas-for-canadians/articleshow/103851685.cms",
        "inLanguage": "en",
        "headline": "Punjab BJP chief welcomes Centre's decision to suspend visas for Canadians",
        "description": "Punjab BJP President, Sunil Jakhar, expressed support for the Indian government's decision to suspend visas for Canadians amid the diplomatic standoff between the two countries. Jakhar accused Canada of prioritizing political advantage over foreign policy and criticized Justin Trudeau for running a minority government. He also praised India's strong stance on terrorism and emphasized the importance of maintaining India's integrity and sovereignty. ",
        "datePublished": "2023-09-22T08:43:00+05:30",
        "articleBody": "Amid a diplomatic standoff between India and Canada, Punjab BJP President, Sunil Jakhar welcomed the Centre's decision to suspend visas for Canadians and said that Canada has mortgaged its foreign policy for the sake of political advantage and Justin Trudeau is running a minority government. Justin Trudeau is speaking his supporter's language. Canada has mortgaged its foreign policy for the sake of political sports land,  said Sunil JakharWelcoming Centre's decision to suspend visa services in Canada, Jakhar said,  If the Trudeau govt will continues to support the separatist forces, the Indian government for the time being keeping careful consideration has suspended visas to develop a system so that India's integrity and sovereignty can be maintained by avoiding these forces entering into India, especially Punjab.  Punjab BJP chief also acknowledged the fact that some people may be facing challenges as their relatives are living in Punjab and said that the integrity of India is more important than the concerns of any individual.  The unity, integrity and brotherhood of the country is more important than the concerns of any individual, whatever is happening is the Canadian government's mistake. Justin Treadu has given a statement without facts or an official record. As they sow seeds, so reap the fruits. Pakistan got hit by inter-gang rivalry and its economy got ruined, Canada is also following the same path.  He said that despite the fact that the Financial Action Task Force sent a notice to Nijjar, the Canadian government provided a safe haven for Nijjar.He lauded the Indian government's foriegn policy and said that we have differences of opinion in domestic policy, but when it comes to foreign policy, we stand united Local politics has no impact on foreign policy. There are many political parties in India. We have differences of opinion in domestic policy, but when it comes to foreign policy, we stand united,  he said.  Justin Trudeau is running a minority government. He is speaking his supporter's language.   He added.He also talked about India's policy on terrorism.  India's stand on terrorism is clear, there is no 'if-but' about terrorism policy in India. There are no shades of grey in terrorism. There is no religion, country, or sect of terrorism, terrorism is terrorism.  He added. The statement from the Punjab BJP President Sunil Jakhar came amid tensions in India-Canada relations after Canadian Prime Minister Justin Trudeau on Monday alleged that the Indian government was behind the fatal shooting of Hardeep Singh Nijjar.Nijjar, who was a designated terrorist in India, was gunned down outside a Gurdwara, in a parking area in Canada's Surrey, British Columbia on June 18.Justin Trudeau during a debate in the Canadian Parliament, claimed his country's national security officials had reasons to believe that  agents of the Indian government  carried out the killing of the Canadian citizen, who also served as the president of Surrey's Guru Nanak Sikh Gurdwara.The allegations made by the Canadian Prime Minister and foreign minister were rejected by the Ministry of External Affairs in India which dubbed the statements as absurd.  We have seen and rejected the statement of the Canadian Prime Minister in their Parliament, as well as the statement by their Foreign Minister. Allegations of the Government of India's involvement in any act of violence in Canada are absurd and motivated  the statement said. "
    },
    {
        "url": "https://economictimes.indiatimes.com/topic/government-and-sports-ministry/news/sports/the-asian-games-larger-than-the-olympics-and-with-an-array-of-regional-and-global-sports/articleshow/103837484.cms",
        "inLanguage": "en",
        "headline": "The Asian Games: Larger than the Olympics and with an array of regional and global sports",
        "description": "The Asian Games, set to begin on Saturday in Hangzhou, China, will feature over 12,000 participants, more than the expected number for next year's Paris Olympics. The games will showcase a wide range of events, including regional specialties like dragon boat racing and kabaddi, as well as popular sports like cricket and squash. China is expected to dominate the medal table, followed by Japan and South Korea. The games will also see the participation of North Korea, which skipped the Tokyo Olympics due to border closures caused by the pandemic. ",
        "datePublished": "2023-09-21T16:21:00+05:30",
        "articleBody": "The Asian Games are an attention grabber. For starters, they involve more participants than the Summer Olympics. Organizers say more than 12,000 will be entered when the opening ceremony takes place Saturday in the eastern Chinese city of Hangzhou. This is more than the 10,500 expected for next year's Paris Olympics. The giant numbers are partly due to the staggering array of events with many regional specialties, sports, and games you won't find in the Olympics. And there's also cricket, which appears headed to the Olympics as soon as 2028 in Los Angeles, and certainly for 2032 in Brisbane, Australia. And there's squash, which has tried several times for Olympic recognition. The regional fare includes dragon boat racing, sepaktakraw - sometimes called  kick volleyball - wushu, a Chinese martial art, and kabaddi, a popular contact sport on the Indian subcontinent. There is also the non-Olympic martial art of ju-jitsu, and kurash, a form of wrestling popular in central Asia. To this, add a long list of what organizers call  mind sports  from bridge to chess to xiangqi (Chinese chess) to esports. Of course, there are the old standbys seen in every Olympics like track and field, swimming, or volleyball - and the usual grandiose opening and closing ceremonies. Nine sports will offer qualification spots for the Olympics - archery, artistic swimming, boxing, breaking, hockey, modern pentathlon, sailing, tennis, and water polo. However, most of the 481 events offer a chance for smaller delegations to win medals, which is often impossible at the Olympics. China won almost 300 overall medals at the last Asian Games in Indonesia in 2018. At the bottom of the table, Syria and Nepal won a lone medal each. Bhutan and Bangladesh were among nine delegations that didn't win any. China will dominate the medal table as it has for the last 40 years, followed by Japan and South Korea - Asia's other powers. The vast region stretches from Lebanon on the Mediterranean, through central Asia and the Indian subcontinent, to North Korea with organizers saying 45 nations or territories are entered. Organizers have said 191 participants from North Korea will be on hand. North Korea closed it border early in 2020 after the COVID-19 pandemic and skipped the Tokyo Olympics, which were delayed a year until 2021. The Asian Games were also pushed back a year from 2022 because of the pandemic. According to South Korea's Unification Ministry, the last time North Korean athletes appeared in an international sports competition was January 2020, when North Korea competed in the Asian Football Confederation's under-23 soccer championship. If you like political intrigue, there may be plenty of it. The self-governing island of Taiwan will be on hand in China, which claims the democracy as a breakaway province that it has vowed to reclaim it. Known as the Republic of China, the island is officially listed as Chinese Taipei in the Olympics and Asian Games and marches under a white flag adorned with the Olympics rings. Its red, blue and white flag is in not allowed. Taiwan, with only 23.5 million, is a relative sports power in the region and finished seventh in the overall medal standings in Indonesia. The games also begin amid an open power struggle between International Olympic Committee President Thomas Bach and Kuwait's Sheikh Ahmad Al-Fahad Al-Sabah, a long-time IOC member who is often described as the  kingmaker  who helped Bach win the IOC presidency in Buenos Aires in 2013. The Switzerland-based IOC openly intervened in July to invalidate the presidential election of the Olympic Council of Asia. It has also suspended Sheikh Ahmad from the IOC. The election was ostensibly won by Kuwait's Sheikh Talal Fahad Al-Ahmad Al-Sabah, the younger brother of Sheikh Ahmad. The elder sheikh is the former 30-year president of the OCA, an organization that was created by his father. The IOC says it will continue to recognize Randhir Singh of India as interim president of the OCA until new elections are held. Bach will attend the opening ceremony in Hangzhou and is sure to have talks with Singh. The biggest event of the games might be a possible India vs. Pakistan gold-medal game in men's cricket on Oct. 7, which would be one of the most-watched global sports events all year. It comes just as cricket's world cup is also underway. China will again dominate diving, and several of China's top swimmers - fresh from the world championships two months ago in Fukuoka, Japan - will shine. The field in gymnastics is weakened since the world championships in Antwerp, Belgium, clash with the Asian Games. The biggest winner at the Asian Games might be South Korea esports star Lee Sang-hyeok, who is also known as  Faker.  If he wins gold he will be granted an exemption from military service. Tottenham Hotspur soccer forward Son Heung-min also bypassed a 21-month military stint because of a government exemption when South Korea won the gold medal in soccer at the 2018 games in Indonesia - although Son still had to do three months of basic training."
    },
    {
        "url": "https://economictimes.indiatimes.com/topic/government-and-sports-ministry/news/new-updates/padma-awards-2024-nominations-deadline-extended-to-september-15-for-exceptional-achievements/articleshow/103600539.cms",
        "inLanguage": "en",
        "headline": "Padma Awards 2024 nominations: Deadline extended to September 15 for exceptional achievements",
        "description": "The Indian government has extended the deadline for nominations for the prestigious Padma Awards 2024. The awards, including Padma Vibhushan, Padma Bhushan, and Padma Shri, will be announced on Republic Day. Nominations can be submitted online, and a citation of up to 800 words is required to highlight the achievements of the recommended individuals. These awards aim to recognize outstanding work across various domains and encourage citizens to nominate deserving candidates from different sections of society. The deadline for submissions is September 15.",
        "datePublished": "2023-09-12T13:06:00+05:30",
        "articleBody": "The central government has extended the deadline for nominations or recommendations for the prestigious Padma Awards 2024. The awards, which include Padma Vibhushan, Padma Bhushan, and Padma Shri, will be announced on Republic Day, 2024. This extension provides an opportunity for citizens to put forward deserving candidates who have excelled in various fields.Nominations and recommendations for the Padma Awards have been open since May 1 and can be submitted online through the Rashtriya Puraskar Portal at https://awards.gov.in. To be considered for these esteemed honors, a citation of up to 800 words is required. This citation should clearly highlight the distinguished and exceptional achievements or service of the person being recommended in their respective field.The Padma Awards, established in 1954, hold a significant place as some of the highest civilian awards in the country. They are traditionally announced on the eve of Republic Day each year. These awards aim to acknowledge outstanding work and accomplishments across various domains, including Art, Literature and Education, Sports, Medicine, Social Work, Science and Engineering, Public Affairs, Civil Service, Trade and Industry.It's important to note that government servants, with the exception of doctors and scientists, are not eligible for Padma Awards. The Ministry of Home Affairs has urged all citizens to actively participate in the nomination and recommendation process. They are encouraged to nominate individuals who have made noteworthy contributions to society, including those from women, weaker sections of society, SCs & STs, divyang persons, and others who are dedicatedly serving the community.As the deadline for submissions approaches on September 15, it is an opportunity for the nation to come together and celebrate the exceptional achievements of individuals who have made a difference in various fields. The Padma Awards continue to symbolize the recognition of excellence and dedicated service in the diverse tapestry of Indian society."
    },
    {
        "url": "https://economictimes.indiatimes.com/topic/government-and-sports-ministry/news/india/ex-wfi-chief-brij-bhushan-singh-not-exonerated-by-oversight-panel-in-sexual-harassment-case-police-tell-court/articleshow/103717806.cms",
        "inLanguage": "en",
        "headline": "Ex-WFI chief Brij Bhushan Singh not exonerated by oversight panel in sexual harassment case: Police tell c",
        "description": " Singh was not exonerated by the oversight committee. The committee had given the recommendations, not the decision... Nowhere has it stated that these allegations are not substantiated or are false,  special public prosecutor Atul Srivastava told the court.",
        "datePublished": "2023-09-16T18:45:00+05:30",
        "articleBody": "Former WFI chief and BJP MP Brij Bhushan Sharan Singh, accused of sexual harassment of several women wrestlers, was not exonerated by the oversight committee constituted by the government to investigate the allegations against him, Delhi police told a city court on Saturday. The police made the submission before Additional Chief Metropolitan Magistrate Harjeet Singh Jaspal during the argument on whether to frame charges against Singh in the case.  Singh was not exonerated by the oversight committee. The committee had given the recommendations, not the decision... Nowhere has it stated that these allegations are not substantiated or are false,  special public prosecutor Atul Srivastava told the court. He urged the court to frame the charges against Singh, saying even a mere gesture can constitute a crime under section 354 (Assault or criminal force to woman with intent to outrage her modesty) of the Indian Penal Code. The Delhi police had filed a charge sheet against the six-time MP on June 15 under sections 354 (assault or criminal force to woman with intent to outrage her modesty), 354A (sexual harassment), 354D (stalking) and 506 (criminal intimidation) of the Indian Penal Code (IPC).  Singh appeared before the court during the proceedings of the case on Saturday. Delhi police will resume its arguments on September 23 on the charges against Singh. The Union Sports Ministry had constituted an oversight committee headed by Indian boxing great M C Mary Kom to investigate the allegations levelled by women wrestlers against Singh after their protest in the national capital. Its report was not made public but a copy was given to the Delhi police who are probing the allegations against Singh. The court had on July 20 granted bail to Singh and suspended Wrestling Federation of India (WFI) assistant secretary Vinod Tomar. They were never arrested in the case."
    },
    {
        "url": "https://economictimes.indiatimes.com/topic/government-and-sports-ministry/news/economy/foreign-trade/saudi-arabia-showcases-soft-power-attractiveness-via-unique-exposition-in-delhi/articleshow/103595942.cms",
        "inLanguage": "en",
        "headline": "Saudi Arabia showcases soft power & attractiveness via unique exposition in Delhi",
        "description": "The Ministry of Media, Kingdom of Saudi Arabia, concluded its first international edition of Media Oasis in New Delhi. The event showcased the achievements made in more than 20 projects under Vision 2030, aimed at diversifying the country economically, socially, and culturally. The exhibition featured interactive exhibits that allowed visitors to experience these initiatives. ",
        "datePublished": "2023-09-12T11:11:00+05:30",
        "articleBody": "Ministry of Media, Kingdom of Saudi Arabia concluded its first international edition of Media Oasis which was held in New Delhi from September 9 – 11. The event comes in conjunction with the state visit of Crown Prince Mohammad bin Salman to India.Across 12 large pavilions, the Media Oasis showcased the transformation and achievements made in more than 20 projects under Vision 2030, an initiative of the Kingdom of Saudi Arabia aimed towards the diversification of the country – economically, socially, and culturally.The event featured tech-based interactive and immersive exhibits that allowed visitors to experience these initiatives in a unique manner. Through this exhibition, the Ministry of Media enhanced visitors’ experience by engaging their minds, senses, and emotions, through visuals and sounds.The Kingdom's prominent role in the media, culture, and tourism sectors, coupled with its keen aspiration to shed light on the remarkable transformation aligned with Vision 2030, was the driving force behind hosting this international edition of the Oasis.At the Media Oasis, the Ministry of Media showcased variousinitiatives being taken by the Ministry of Energy, Sport, Investment, and Culture, alongside the Saudi Data and Artificial Intelligence Authority (SDAIA), the Red Sea International Company, the Royal Institute of Traditional Arts, the Future Investment Initiative (FIII), the Centre for Government Communication, and the Saudi Konoz Initiative. Media Oasis was attended by a host of Indian and foreign delegates with senior officials from Saudi Arabia. The exhibition took place at The Oberoi Hotel in Delhi This is the third edition of the Media Oasis. The first was held in Jeddah on May 18 and 19, 2023, in conjunction with the 32nd Arab Summit. The second was held from June 20 to 22, 2023, in conjunction with the Grand Annual Hajj Symposium."
    },
    {
        "url": "https://economictimes.indiatimes.com/topic/government-and-sports-ministry/news/sports/we-will-return-with-best-medal-count-from-asian-games-anurag-thakur/articleshow/103404850.cms",
        "inLanguage": "en",
        "headline": "We will return with best medal count from Asian Games: Anurag Thakur",
        "description": "Sports Minister Anurag Thakur said,  I am confident that as much as the team will represent the young and new India; we will ensure historic performances and return with the best medal count. I urge the country to stand behind our athletes and cheer for them.  ",
        "datePublished": "2023-09-05T22:35:00+05:30",
        "articleBody": "Sports Minister Anurag Thakur on Tuesday asserted that the Indian contingent will win a record number of medals in the upcoming Asian Games in Hangzhou, China.The Sports Ministry has given approval to 634 athletes from 38 different sporting disciplines to participate in the quadrennial Games, which will be held in the Chinese city from September 23 to October 8. I am confident that as much as the team will represent the young and new India; we will ensure historic performances and return with the best medal count. I urge the country to stand behind our athletes and cheer for them,  Thakur said during the team's send-off ceremony in the capital.During the function, the Indian Olympic Association (IOA) unveiled the official ceremonial dress and playing kit for the Indian contingent that will compete at the forthcoming Games. Additional Rs 675 crore has been approved by the government for infrastructure building and Khelo India Games,  the minister added.Besides Thakur, the ceremony was attended by IOA president PT Usha along with other senior officials.The Indian contingent was represented by hockey goalkeepers PR Sreejesh (men), Savita Punia (women), shooter Manu Bhaker and 2018 Asian Games shot put gold medallist Tajinderpal Singh Toor among others.Usha said she expects every member of the contingent to make the best effort. We have waited long for the 2022 Asian Games and are delighted that India is sending its largest contingent of 634 athletes. We believe that this squad has the potential to get India its best medal haul as well,  she said.The Indian contingent clinched 70 medals, including 16 gold, in the last edition of the Asian Games in 2018.Conceived and designed by the National Institute of Fashion Technology, the ceremonial dress includes a khaki textured saree for women and khaki kurta for the male players.The playing kit is designed by Kashmiri designer Aaquib Wani who has also designed the Indian cricket team jersey.With 33 members, rowing will have the largest unit after athletics (65) in Hangzhou. Meanwhile, a 15-member Esports team will also be at the Asian Games where the event makes its debut."
    },
    {
        "url": "https://economictimes.indiatimes.com/topic/government-and-sports-ministry/news/economy/policy/india-makes-sweeping-changes-in-ministries-from-aviation-and-telecom-to-parliamentary-affairs/articleshow/103266132.cms",
        "inLanguage": "en",
        "headline": "India makes sweeping changes in ministries from aviation and telecom to parliamentary affairs",
        "description": "India has appointed new secretaries in various key departments and ministries, such as parliamentary affairs, civil aviation, and mines. Umang Narula has been appointed as the parliamentary affairs secretary, while Vumlunmang Vualnam will be the new secretary of the civil aviation ministry. This comes after the government has called for a special session of Parliament for five days starting September 18.",
        "datePublished": "2023-09-01T09:47:00+05:30",
        "articleBody": "India has reshuffled and appointed secretaries in various key departments and ministries ranging from parliamentary affairs, civil aviation to mines at a time when the relevant industries are seeing major developments.The Appointments Committee of the Cabinet has approved the appointment of Umang Narula as the parliamentary affairs, according to a government statement. Narula will be replacing Gudey Srinivas, who will move to take up the role of secretary at National Commission for Scheduled Castes under the Ministry of Social Justice and Empowement.This comes after the government has called for a special session of Parliament for five days starting September 18. However, no official announcement has been made regarding the agenda of the session which will be held days after the G20 Summit in the national capital, Delhi, on September 8 to 10, 2023.Also Read: India forms committee to explore possibility of 'one nation, one election'Speculations are rife though that the Narendra Modi government may bring 'One Nation, One Election' Bill in the special Parliament session. This, as the name suggests, means simultaneous state and general elections. This needs a constitutional amendment for which the lawmakers need to meet in a parliament session.India's Lok Sabha elections are scheduled next year.Meanwhile, India has also appointed Vumlunmang Vualnam as the secretary of civil aviation ministry and he replaced Rajiv Bansal upon his superannuation on Aug 31. Vualnam was working as an additional secretary in the Department of Economic Affairs under the Ministry of Finance.Chanchal Kumar, who is an Officer on Special Duty in the civil aviaiton ministry, was earlier supposed to replace Bansal. However, Kumar will now move to the Ministry of Development of North Eastern Region as a secretary.V. L. Kantha Rao will now take up the role of secretary at the Ministry of Mines, replacing VivekBhardwaj, upon his appointment as Officer on Special Duty in the Ministry of Panchayati Raj.While Kantha Rao will vacate his chair as the additional secretary at the Department of Telecommunications, Neeraj Mittal will become the new secretary in this department.Mittal will take the role as DoT secretary at a time when the Indian government is working on finalising a telecom bill and mulls key decisions around allocation of satellite spectrum.Bhardwaj will take be appointed as Officer on Special Duty, Ministry of Panchayati Raj, in the rank and payof Secretary to the Government of India, replacing Sunil Kumar upon his superannuation on October 31.Bhardwaj, as the mines secretary, had recently told media that India is preparing to start the auction process for some 100 critical mineral blocks in the next four months.The government has also appointed S. Krishnan as secretary in the Ministry of Electronics and Information Technology. He replaced Alkesh Kumar Sharma upon his superannuation on August 31.Krishnan is likely to guide the next phase of the implementation of the country’s ambitious semiconductor mission, which aims to foster a homegrown chip and supporting component ecosystem. The new secretary will also have to be at the forefront of the rollout of the recently enacted Digital Personal Data Protection (DPDP) Act, 2023 implementation guidelines along with the Digital India Bill, which will overhaul the IT Act, 2000. Ashish Upadhyay, now special secretary and financial advisor in the Ministry of Power, will move to National Commission for Backward Classes as the secretary and replace Rajeev Ranjan upon his superannuation on December 31.Among other appointments, Katikithala Srinivas was named as new secretary in the minority affairs ministry, Shashi Ranjan Kumar as secretary in Union Public Service Commission and Sanjay Rastogi as additional secretary & financial advisor in the youth affairs & sports ministry. "
    },
    {
        "url": "https://economictimes.indiatimes.com/topic/government-and-sports-ministry/news/india/11-ministries-yet-to-finalise-accessibility-guidelines-for-people-of-disabilities-govt/articleshow/102178099.cms",
        "inLanguage": "en",
        "headline": "11 ministries yet to finalise accessibility guidelines for people of disabilities: Govt",
        "description": "The Indian government has revealed that 11 ministries are yet to finalize sector-specific accessibility guidelines for disabled people. The report, presented to the parliamentary standing committee on social justice and empowerment, showed that of the 20 departments entrusted with formulating sector-specific accessibility guidelines, only nine have done so. ",
        "datePublished": "2023-07-27T19:56:00+05:30",
        "articleBody": "New Delhi, Eleven ministries are yet to finalise their sector-specific accessibility guidelines for people with disabilities, the government said on Thursday. The information was shared by the Social Justice and Empowerment Ministry with the parliamentary standing committee on social justice and empowerment. The parliamentary panel report was tabled in Lok Sabha on Thursday.  The ministry said the departments of Law and Justice, Consumer Affairs and Telecommunication are following the guidelines of MEITY and MoHUA respective to their domain related to people with disabilities.   Other than this, five Ministries namely MoHUA, Ministry of Civil Aviation, Ministry of Culture, Ministry of Health and Family Welfare and Department of Sports have notified their guidelines in the official gazette and are currently underway of draft and final notification in The Rights of Persons with Disabilities (RPWD) Act, 2016 Rules,  the ministry told the parliamentary panel.  The ministry said that the  remaining eleven ministries are at various stages of finalisation of their respective sector-specific accessibility guidelines .  The Committee, in response, said it finds that while progress has been made in terms of framing Accessible India Campaign (AIC) specific guidelines, training, etc, yet the objectives of the scheme are far from being realised.   For instance, so far out of the 20 ministries/departments entrusted with the task of formulation of Sector Specific Standards of Accessibility, only nine ministries have done it so far and 11 are yet to finalise their guidelines,  the panel said.  The Committee said it would like to stress the fact that AIC seeks to build a truly inclusive and barrier-free environment for People with Disabilities (PwDs) and hence such a lackadaisical attitude of some of the government agencies is  very disheartening .  It urged the department to accord utmost priority to removing any impediments in the successful implementation of the scheme and to continuously remind the remaining departments to finalise their guidelines expeditiously in coordination with the Ministries/states/UTs so as to enable the PwDs to avail the intended benefits seamlessly  Also, the Committee, chaired by MP Rama Devi, said that it has recommended a proactive approach for the exemption of Goods and Services Tax (GST) on aids and appliances for PwDs as such an action would make aids and appliances more affordable.   The Committee is of the opinion that aids and appliances are essential items for persons with disabilities for their daily mobility to gain access to the opportunities of education, employment or enjoyment of other rights or the discharge of duties as responsible citizens,  it said.   Hence, the committee would like to reiterate their earlier recommendation and urge the Department to continue with sustained efforts to prioritise the removal of GST on aids and appliances, as without them many PwDs would be forced into living a restricted and confined life or in a state of seclusion,  the panel said."
    }
]